Test .NET Development.postman_collection.json

{
	"info": {
		"_postman_id": "937c9ea8-6a85-478f-be7d-de3eea8c8078",
		"name": "Test .NET Development",
		"schema": "https://schema.getpostman.com/json/collection/v2.1.0/collection.json",
		"_exporter_id": "5170147"
	},
	"item": [
		{
			"name": "01- Testing",
			"request": {
				"method": "POST",
				"header": [],
				"body": {
					"mode": "raw",
					"raw": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\r\n<soap:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n    <soap:Body>\r\n        <Test xmlns=\"http://tempuri.org/\">\r\n            <s>Validando Servicio</s>\r\n        </Test>\r\n    </soap:Body>\r\n</soap:Envelope>",
					"options": {
						"raw": {
							"language": "xml"
						}
					}
				},
				"url": {
					"raw": "http://localhost:5044/EnrollmentService.asmx",
					"protocol": "http",
					"host": [
						"localhost"
					],
					"port": "5044",
					"path": [
						"EnrollmentService.asmx"
					]
				}
			},
			"response": []
		},
		{
			"name": "02 - Proceso de Inscripicon",
			"request": {
				"method": "POST",
				"header": [],
				"body": {
					"mode": "raw",
					"raw": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\r\n<soap:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n    <soap:Body>\r\n        <EnrollmentProcess xmlns=\"http://tempuri.org/\">\r\n            <request>\r\n                <NoExpediente>EXP-202200030</NoExpediente>\r\n                <Ciclo>2022</Ciclo>\r\n                <MesInicioPago>2</MesInicioPago>\r\n                <CarreraId>AB8B51A6-6F09-4C1F-9FDB-197FF9DC3C3C</CarreraId>                \r\n            </request>\r\n        </EnrollmentProcess>\r\n    </soap:Body>\r\n</soap:Envelope>",
					"options": {
						"raw": {
							"language": "xml"
						}
					}
				},
				"url": {
					"raw": "http://localhost:5044/EnrollmentService.asmx",
					"protocol": "http",
					"host": [
						"localhost"
					],
					"port": "5044",
					"path": [
						"EnrollmentService.asmx"
					]
				}
			},
			"response": []
		}
	]
}